Xml-integration-demo/HotelRQ/20210603222603873AvailableHotelRooms.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><hot:Credentials Password="Sra@12896022" UserName="WESARA"/><wsa:Action>http://TekTravel/HotelBookingApi/AvailableHotelRooms</wsa:Action><wsa:To>https://api.tboholidays.com/HotelApi_V7/HotelService.svc</wsa:To></env:Header><env:Body><HotelRoomAvailabilityRequest xmlns="http://TekTravel/HotelBookingApi"><SessionId>4d166d87-6c83-46fe-8d70-9548548b64e5</SessionId><ResultIndex>10</ResultIndex><HotelCode>1419660</HotelCode><ResponseTime>17</ResponseTime><IsCancellationPolicyRequired>false</IsCancellationPolicyRequired></HotelRoomAvailabilityRequest></env:Body></env:Envelope>